// Add task
// Edit task
// Delete task
// Show task
// Show alert
// Delete all tasks
// Save to the LS

// Модуль управления задачами (управлять массивом)
// - Получать все задачи
// - Устанавливать список задач
// - Добавить задачу
// - Удалить задачу

// Модуль генерации id
// - Генерирование id

// Модуль UI (управление разметкой списка задач)
// - Добавление/удаление одной задачи
// - Генерация списка задач
// - Проверка наличия задач в спискеи вывод уведомления о пустом списке


// Модуль работы с LS
// - Обновление LS
// - Получение задач из  LS

// Модуль nofity управление уведомлениями
// - Вывод и удаление сообщений

// Модуль наблюдателя Observer реализация подписки на события
